# Pandas


## Key features

## Installation of pandas

## Pandas data structure

## Functionality of Series and Dataframe

## Statistic by pandas

## Pandas

It is an open-source library built on top of Python and it is used specifically for data manipulation and analysis

Pandas can be used for data visualization

## Key features

Can load different file format like CSV, Excel, Jason etc.

Handle missing data, messy data sets, clean data

Reshaping and pivoting of date sets.

Slicing, indexing and sub setting of large data sets.

Rows and columns from a data structure can be deleted or inserted.

Group by data for aggregation(sum, max, min, count etc.) and transformations.

Merging and joining of data.

Time Series functionality.

It will allows us to analyze big data and can conclude based on statistical measure.

## Pandas data structure

## Series

Pandas Series is nothing but a column in an excel sheet

It is a one-dimensional labeled array capable of holding data of any type (integer,list, string, float, python objects, etc.) but at a time only one data type can hold

Key Points 1: Homogeneous data 2 :Size Immutable 3 :Values of Data Mutable

In [ ]:
2**20

In [ ]:
# pip install pandas ## do not run again and again only once

## Series

In [ ]:
# pip install pandas

In [2]:
import pandas

In [3]:
pandas.Series([10,2,3,40])

0    10
1     2
2     3
3    40
dtype: int64

In [6]:
pandas.Series([10,20,30,'40',50.8])

0      10
1      20
2      30
3      40
4    50.8
dtype: object

In [5]:
pandas.Series(['a','b','c','d'])

0    a
1    b
2    c
3    d
dtype: object

In [2]:
import pandas as pd

In [8]:
pd.Series()

Series([], dtype: object)

In [9]:
[]

[]

In [10]:
df = pd.Series()
df

Series([], dtype: object)

In [11]:
df

Series([], dtype: object)

In [12]:
a = [1,2,3,4,5]
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
a = [1,'2',3,4,5.8]
pd.Series(a)

0      1
1      2
2      3
3      4
4    5.8
dtype: object

In [14]:
a = [1,3,3,4.8,5]
f = pd.Series(a)

In [15]:
f

0    1.0
1    3.0
2    3.0
3    4.8
4    5.0
dtype: float64

In [17]:
f[1] = 90

In [18]:
f

0     1.0
1    90.0
2     3.0
3     4.8
4     5.0
dtype: float64

## Dataframe

It is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

A pandas DataFrame can be created using : Lists , dictionary , Series , Numpy ndarrays , Another DataFrame

Dataframe can hold:

Heterogeneous data (integer, string, float, bool,) simultaneously and its size is mutable

In [19]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [20]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [21]:
a = pd.DataFrame()
print(a)

Empty DataFrame
Columns: []
Index: []

In [22]:
pd.DataFrame([1,2,'54',39,'qw'])

    0
0   1
1   2
2  54
3  39
4  qw

In [23]:
pd.DataFrame([1,2,'54',39,'qw'],columns='X')  # error

TypeError: Index(...) must be called with a collection of some kind, 'X' was passed

In [24]:
pd.DataFrame({1,2,'54',39,'qw'},columns=['X'])

    X
0   1
1   2
2  39
3  qw
4  54

In [27]:
f = pd.DataFrame(range(10,20),columns=['x']) # homogenous data which is integer

# type(f)
f

    x
0  10
1  11
2  12
3  13
4  14
5  15
6  16
7  17
8  18
9  19

In [28]:
f['x']

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
Name: x, dtype: int64

In [29]:
type(f['x'])

pandas.core.series.Series

In [30]:
type(f)

pandas.core.frame.DataFrame

In [33]:
type({4})

set

In [34]:
{'name':'Rani'} # {key : value}

{'name': 'Rani'}

In [35]:
d = {'name':['Rani','prem','Rock'],
     'Age':[30,32,40]
    }

In [42]:
d['name'][1]='apple'

In [43]:
d

{'name': ['Rani', 'apple', 'Rock'], 'Age': [30, 32, 40]}

In [47]:
'a'=='A'

False

In [44]:
df = pd.DataFrame(d)
df

    name  Age
0   Rani   30
1  apple   32
2   Rock   40

In [48]:
d = {'name':['Rani','prem','Rock'],
     'Age':[30,32,40],
     'age':[300,32,40]
    }
pd.DataFrame(d)

   name  Age  age
0  Rani   30  300
1  prem   32   32
2  Rock   40   40

In [55]:
d = {'name':['Rani','prem','Rock'],
     'Age':[30,32,40],
     'dep':['a','b','c'],
     'Age':[300,32,40]
    }
pd.DataFrame(d)

   name  Age dep
0  Rani  300   a
1  prem   32   b
2  Rock   40   c

In [54]:
df

    name  Age
0   Rani   30
1  apple   32
2   Rock   40

In [52]:
df['Age']

0    30
1    32
2    40
Name: Age, dtype: int64

In [56]:
df.shape

(3, 2)

In [57]:
df.size

6

In [60]:
d = {
    'col1':[1,2,3,4],
    'col2':['apple','kiwi','grapes']
}
d1 = pd.DataFrame(d)

d1 # error

ValueError: All arrays must be of the same length

In [3]:
d = {
    'col1':[1,2,3,4],
    'col2':['apple','kiwi','grapes','']
}
d1 = pd.DataFrame(d)

d1

   col1    col2
0     1   apple
1     2    kiwi
2     3  grapes
3     4

In [66]:
c = [1,20,1,0]
d1['E'] = c

In [67]:
d1

   col1    col2   E
0     1   apple   1
1     2    kiwi  20
2     3  grapes   1
3     4           0

In [70]:
import warnings 
warnings.filterwarnings('ignore')

In [71]:
d1['col2'][2] = 'mango'

In [72]:
d1

   col1   col2   E
0     1  apple   1
1     2   kiwi  20
2     3  mango   1
3     4          0

In [73]:
d1.columns

Index(['col1', 'col2', 'E'], dtype='object')

In [75]:
d1.drop('E',axis=1)

   col1   col2
0     1  apple
1     2   kiwi
2     3  mango
3     4

In [76]:
d1

   col1   col2   E
0     1  apple   1
1     2   kiwi  20
2     3  mango   1
3     4          0

In [78]:
d2 = d1.drop('E',axis=1)
d2

   col1   col2
0     1  apple
1     2   kiwi
2     3  mango
3     4

In [79]:
d1

   col1   col2   E
0     1  apple   1
1     2   kiwi  20
2     3  mango   1
3     4          0

In [81]:
d1.drop('col2',axis = 1,inplace=True)

In [82]:
d1

   col1   E
0     1   1
1     2  20
2     3   1
3     4   0

In [83]:
d1 = d1.drop(3,axis=0) # removing rows
d1

   col1   E
0     1   1
1     2  20
2     3   1

In [ ]:
del d1['col1']

In [ ]:
d1

In [ ]:
del d1

In [ ]:
d1

In [2]:
import pandas as pd

In [12]:
d = {
    'nam@e  ' : ['Raju','Rahul','Pallavi','Anjali','Pavani','Vijay','Sai'],
    ' Ag@e  ' : [20,30,19,34,27,50,80],
    '  @Salary  ' : [1000,2000,3400,4000,2348,5400,3001]
}
df = pd.DataFrame(d)

In [13]:
df

   nam@e     Ag@e      @Salary
0     Raju       20         1000
1    Rahul       30         2000
2  Pallavi       19         3400
3   Anjali       34         4000
4   Pavani       27         2348
5    Vijay       50         5400
6      Sai       80         3001

In [6]:
df['nam@e'] # error

KeyError: 'nam@e'

In [7]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [9]:
df['Name'] = df['nam@e']

KeyError: 'nam@e'

In [15]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [16]:
a = '   sell    '
a.strip()

'sell'

In [17]:
a

'   sell    '

In [21]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [19]:
c = df.columns.str.strip()

In [22]:
c

Index(['nam@e', 'Ag@e', '@Salary'], dtype='object')

In [24]:
c = c.str.replace('@','')

In [25]:
c

Index(['name', 'Age', 'Salary'], dtype='object')

In [26]:
df.columns = c

In [27]:
df.columns

Index(['name', 'Age', 'Salary'], dtype='object')

In [28]:
df['name']

0       Raju
1      Rahul
2    Pallavi
3     Anjali
4     Pavani
5      Vijay
6        Sai
Name: name, dtype: object

In [29]:
df['Name']=df['name']

In [30]:
df

      name  Age  Salary     Name
0     Raju   20    1000     Raju
1    Rahul   30    2000    Rahul
2  Pallavi   19    3400  Pallavi
3   Anjali   34    4000   Anjali
4   Pavani   27    2348   Pavani
5    Vijay   50    5400    Vijay
6      Sai   80    3001      Sai

In [31]:
df.drop('name',axis = 1,inplace=True)

In [32]:
df

   Age  Salary     Name
0   20    1000     Raju
1   30    2000    Rahul
2   19    3400  Pallavi
3   34    4000   Anjali
4   27    2348   Pavani
5   50    5400    Vijay
6   80    3001      Sai

In [33]:
# import pandas as pd
d = {'na@m$e ':pd.Series(['tom ','dick','harry','jay','veeru','ram','laxman']),
   ' @age':pd.Series([-20,32,45,-32,32,14,15,38]),
   '  dat#i$ng':pd.Series([4.23,-3.24,3.98,2.56,-3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
df.columns

Index(['na@m$e ', ' @age', '  dat#i$ng'], dtype='object')

In [34]:
df

  na@m$e    @age    dat#i$ng
0    tom     -20        4.23
1    dick     32       -3.24
2   harry     45        3.98
3     jay    -32        2.56
4   veeru     32       -3.20
5     ram     14        4.60
6  laxman     15        3.80
7     NaN     38         NaN

In [35]:
c = df.columns.str.strip()

c

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [40]:
df.columns = c

In [43]:
df['na@m$e']

0      tom
1      dick
2     harry
3       jay
4     veeru
5       ram
6    laxman
7       NaN
Name: na@m$e, dtype: object

In [38]:
c.str.replace('$','')

Index(['na@me', '@age', 'dat#ing'], dtype='object')

In [44]:
df1 = df.rename(columns={'na@m$e':'NAME','@age':'AGE', 'dat#i$ng':'DATING'})
df1

     NAME  AGE  DATING
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
5     ram   14    4.60
6  laxman   15    3.80
7     NaN   38     NaN

In [45]:
d = {'na@m$e ':pd.Series(['tom ','dick','harry','jay','veeru','ram','laxman']),
   ' @age':pd.Series([-20,32,45,-32,32,14,15,38]),
   '  dat#i$ng':pd.Series([4.23,-3.24,3.98,2.56,-3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
df

  na@m$e    @age    dat#i$ng
0    tom     -20        4.23
1    dick     32       -3.24
2   harry     45        3.98
3     jay    -32        2.56
4   veeru     32       -3.20
5     ram     14        4.60
6  laxman     15        3.80
7     NaN     38         NaN

In [46]:
c = df.columns.str.strip()
c

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [53]:
20/3

6.666666666666667

In [56]:
137 % 2

1

In [59]:
o = []
e = []
for i in range(10):
    if i % 2 == 0:
        e.append(i)
    else:
        o.append(i)

In [60]:
o

[1, 3, 5, 7, 9]

In [61]:
c

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [63]:
h = 'welcome'
k = ''
for i in h :
    k = i+k
k

'emoclew'

In [64]:
c

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [74]:
w = []

for i in c:
    l =  ''
    for j in i:
        if j in ['#', '$', '@']:
            l = l+''
        else:
            l = l + j
    # print(l) 
    w.append(l)

In [75]:
w

['name', 'age', 'dating']

In [76]:
df.columns = w
df

     name  age  dating
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
5     ram   14    4.60
6  laxman   15    3.80
7     NaN   38     NaN

In [ ]:
g = []
for i in c:
    x = ''
    for j in i:
        if j == '@' or j=='$' or j=='#':
            x = x + ''
        else:
            x = x+j
    g.append(x)

In [ ]:
g

In [ ]:
df.columns = g

In [ ]:
df['age']